In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv('summer.csv')

In [3]:
men_df = df[df['Gender'] == 'Men']

In [4]:
pd.value_counts(men_df['Athlete']).head(1)

PHELPS, Michael    22
Name: Athlete, dtype: int64

In [5]:
df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [20]:
temp_df = df.groupby(['Medal','Athlete'])['Sport'].count().reset_index().sort_values(by='Sport',ascending=False)

In [21]:
temp_df.drop_duplicates('Medal')

        Medal              Athlete  Sport
15048    Gold      PHELPS, Michael     18
6110   Bronze  OTTEY-PAGE, Merlene      6
26137  Silver     VORONIN, Mikhail      6

In [25]:
temp_df = df.groupby(['Country','Medal'])['Sport'].count().reset_index().sort_values(by='Sport',ascending=False)

In [26]:
temp_df.head()

    Country   Medal  Sport
327     USA    Gold   2235
328     USA  Silver   1252
326     USA  Bronze   1098
321     URS    Gold    838
322     URS  Silver    627

In [27]:
country_df = pd.pivot(temp_df,'Country','Medal','Sport')

In [30]:
country_df = country_df.sort_values(by='Gold',ascending=False).fillna(0.0)

In [31]:
country_df.head()

Medal    Bronze    Gold  Silver
Country
USA      1098.0  2235.0  1252.0
URS       584.0   838.0   627.0
GBR       553.0   546.0   621.0
ITA       404.0   476.0   416.0
GER       475.0   452.0   378.0

In [32]:
import numpy as np

In [33]:
country_df.astype(np.int32).head()

Medal    Bronze  Gold  Silver
Country
USA        1098  2235    1252
URS         584   838     627
GBR         553   546     621
ITA         404   476     416
GER         475   452     378